## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_cloudwatch_query_definition.wordpress_errors`        |
|        | `aws_cloudwatch_query_definition.wordpress_failed_logins` |
|        | `aws_cloudwatch_query_definition.wordpress_warnings`      |
| update | `aws_cloudwatch_log_metric_filter.wordpress_warnings`     |
|        | `module.notify_slack.aws_lambda_function.notify_slack`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.wordpress_warnings will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "wordpress_warnings" {
        id             = "WordPressWarnings"
        name           = "WordPressWarnings"
      ~ pattern        = "?Warning ?warning" -> "[(w1=\"*Warning*\" || w1=\"*warning*\") && w1!=\"*Undefined array key*c3-cloudfront-clear-cache*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_query_definition.wordpress_errors will be created
  + resource "aws_cloudwatch_query_definition" "wordpress_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/ecs/wordpress",
        ]
      + name                = "Wordpress - errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /(?i)error|failed|fatal/
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.wordpress_failed_logins will be created
  + resource "aws_cloudwatch_query_definition" "wordpress_failed_logins" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/ecs/wordpress",
        ]
      + name                = "Wordpress - failed logins"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /LOGIN FAILED/
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.wordpress_warnings will be created
  + resource "aws_cloudwatch_query_definition" "wordpress_warnings" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/ecs/wordpress",
        ]
      + name                = "Wordpress - warnings"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /(?i)warning/
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # module.notify_slack.aws_lambda_function.notify_slack will be updated in-place
  ~ resource "aws_lambda_function" "notify_slack" {
        id                             = "notify_slack"
      ~ last_modified                  = "2023-06-29T19:37:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "FipuaAUTHLWpYfowItg9o9BtNFUGbGVXXpLMyzFzTZY=" -> "iC0Ta5b8fs9u6i/c3LA3/Tk8BUHfS6Jgq4NF8At0CBo="
        tags                           = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "PROJECT_NAME"      = "WordPress" -> "Articles: production"
              ~ "SLACK_WEBHOOK_URL" = (sensitive value)
                # (1 unchanged element hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_4xx_response"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_response_time_average"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_unhealthy_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_4xx_response"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_cpu_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_memory_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_aurora_replica_lag"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_failed_login"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_warnings"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.sns_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.sns_cloudwatch_us_east"]
WARN...
```

</details>
